---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarContainer
source: html/e462b2c1-4a64-dd9d-21b6-0d2b35f7b2ed.htm
---
# RebarContainer Methods

Appends an Item to the RebarContainer. Fills its data on base of the Rebar.